src/Reports/ВедомостьЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ВедомостьЗаказыПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Reports/ВедомостьЗаказыПоставщикам/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки текста запроса построителя отчета
//
Процедура УстановитьТекстЗапроса(ЕстьПолеРегистратор = Истина)

	// Описание исходного текста запроса.
	ТекстЗапроса =
	 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ЗаказыПоставщикамОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаРеглНачальныйОстаток КАК СуммаРеглНачальныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаРеглКонечныйОстаток КАК СуммаРеглКонечныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаРеглПриход КАК СуммаРеглПриход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаРеглРасход КАК СуммаРеглРасход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаУпрНачальныйОстаток КАК СуммаУпрНачальныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаУпрКонечныйОстаток КАК СуммаУпрКонечныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаУпрПриход КАК СуммаУпрПриход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаУпрРасход КАК СуммаУпрРасход,
	 | ЗаказыПоставщикамОстаткиИОбороты.ЕдиницаИзмерения Как ЕдиницаИзмерения,
	 | ЗаказыПоставщикамОстаткиИОбороты.ЕдиницаИзмерения.Владелец Как Номенклатура,	 
	 |	ЗаказыПоставщикамОстаткиИОбороты.Склад КАК Склад,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ТорговаяТочка КАК ТорговаяТочка,
	 |	ПРЕДСТАВЛЕНИЕ(ЗаказыПоставщикамОстаткиИОбороты.Склад),
	 |	ЗаказыПоставщикамОстаткиИОбороты.Регистратор,
	|НАЧАЛОПЕРИОДА(ЗаказыПоставщикамОстаткиИОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|НАЧАЛОПЕРИОДА(ЗаказыПоставщикамОстаткиИОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|НАЧАЛОПЕРИОДА(ЗаказыПоставщикамОстаткиИОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|НАЧАЛОПЕРИОДА(ЗаказыПоставщикамОстаткиИОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|НАЧАЛОПЕРИОДА(ЗаказыПоставщикамОстаткиИОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|НАЧАЛОПЕРИОДА(ЗаказыПоставщикамОстаткиИОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|НАЧАЛОПЕРИОДА(ЗаказыПоставщикамОстаткиИОбороты.Период, ГОД) КАК ПериодГод,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СостояниеСтрокиЗаказа КАК СостояниеСтрокиЗаказа,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента.Организация КАК Организация,
	 |	ПРЕДСТАВЛЕНИЕ(ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента.Организация) Как ПредставлениеОрганизация,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента.Владелец КАК Контрагент
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	 |{ВЫБРАТЬ
	 |	КоличествоНачальныйОстаток,
	 |	КоличествоКонечныйОстаток,
	 |	КоличествоПриход,
	 |	КоличествоРасход,
	 |	СуммаРеглНачальныйОстаток,
	 |	СуммаРеглКонечныйОстаток,
	 |	СуммаРеглПриход,
	 |	СуммаРеглРасход,
	 |	СуммаУпрНачальныйОстаток,
	 |	СуммаУпрКонечныйОстаток,
	 |	СуммаУпрПриход,
	 |	СуммаУпрРасход,
	 |	Склад.*,
	 |	ТорговаяТочка.*,
	 |	Регистратор.*,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод,
	 |	ДоговорКонтрагента.*,
	 |	СостояниеСтрокиЗаказа.*,
	 |  ЕдиницаИзмерения.* Как ЕдиницаИзмерения,
	 |  Номенклатура.* КАК Номенклатура,	 
	 |	Организация.* Как Организация,
	 |	Контрагент.* Как Контрагент
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
		|}
 |ИЗ
	 |	РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {(&Периодичность)}, , {(ДоговорКонтрагента).*, (ДоговорКонтрагента.Владелец).* КАК Контрагент, (ДоговорКонтрагента.Организация).* КАК Организация, (ДоговорКонтрагента.ВалютаВзаиморасчетов).* КАК ВалютаВзаиморасчетов}) КАК ЗаказыПоставщикамОстаткиИОбороты
	|//СОЕДИНЕНИЯ
	 |{ГДЕ
	 |	ЗаказыПоставщикамОстаткиИОбороты.КоличествоНачальныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.КоличествоКонечныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.КоличествоПриход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.КоличествоРасход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаРеглПриход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаРеглРасход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаУпрНачальныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаУпрКонечныйОстаток,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаУпрПриход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СуммаУпрРасход,
	 |	ЗаказыПоставщикамОстаткиИОбороты.Склад.*,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ТорговаяТочка.*,
	 |	ЗаказыПоставщикамОстаткиИОбороты.Регистратор.*,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ПериодДень,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ПериодНеделя,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ПериодДекада,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ПериодМесяц,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ПериодКвартал,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ПериодПолугодие,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ПериодГод,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента.*,
	 |	ЗаказыПоставщикамОстаткиИОбороты.СостояниеСтрокиЗаказа.*,
	 | ЗаказыПоставщикамОстаткиИОбороты.ЕдиницаИзмерения.* Как ЕдиницаИзмерения,
	 | ЗаказыПоставщикамОстаткиИОбороты.ЕдиницаИзмерения.Владелец.* Как Номенклатура,	 
	 |	ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента.Организация.* КАК Организация,
	 |	ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента.Владелец.* Как Контрагент
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	 |{УПОРЯДОЧИТЬ ПО
	 |	Склад.* Как Склад,
	 |	ТорговаяТочка.*,
	 |	Регистратор.*,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод,
	 |	ДоговорКонтрагента.*,
	 |	СостояниеСтрокиЗаказа.*,
	 |	Организация.* Как Организация,
	 |	Контрагент.* Как Контрагент,
	 |  ЕдиницаИзмерения.* Как ЕдиницаИзмерения,
	 |  Номенклатура.* КАК Номенклатура,	 
	 |	КоличествоНачальныйОстаток,
	 |	КоличествоКонечныйОстаток,
	 |	КоличествоПриход,
	 |	КоличествоРасход,
	 |	СуммаРеглНачальныйОстаток,
	 |	СуммаРеглКонечныйОстаток,
	 |	СуммаРеглПриход,
	 |	СуммаРеглРасход,
	 |	СуммаУпрНачальныйОстаток,
	 |	СуммаУпрКонечныйОстаток,
	 |	СуммаУпрПриход,
	 |	СуммаУпрРасход
 |	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	 |ИТОГИ
	 |	СУММА(КоличествоНачальныйОстаток),
	 |	СУММА(КоличествоКонечныйОстаток),
	 |	СУММА(КоличествоПриход),
	 |	СУММА(КоличествоРасход),
	 |	СУММА(СуммаРеглНачальныйОстаток),
	 |	СУММА(СуммаРеглКонечныйОстаток),
	 |	СУММА(СуммаРеглПриход),
	 |	СУММА(СуммаРеглРасход),
	 |	СУММА(СуммаУпрНачальныйОстаток),
	 |	СУММА(СуммаУпрКонечныйОстаток),
	 |	СУММА(СуммаУпрПриход),
	 |	СУММА(СуммаУпрРасход)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	 |ПО
	 |	ОБЩИЕ
	 |{ИТОГИ ПО
	 |	Склад.* Как Склад,
	 |	ТорговаяТочка.*,
	 |	Регистратор.*,
	 |	ПериодДень,
	 |	ПериодНеделя,
	 |	ПериодДекада,
	 |	ПериодМесяц,
	 |	ПериодКвартал,
	 |	ПериодПолугодие,
	 |	ПериодГод,
	 |	ДоговорКонтрагента.* Как ДоговорКонтрагента,
	 |	СостояниеСтрокиЗаказа.*,
	 |	Организация.* Как Организация,
	 |	Контрагент.* Как Контрагент,
	 |  ЕдиницаИзмерения.* Как ЕдиницаИзмерения,
	 |  Номенклатура.* КАК Номенклатура	 
	 |	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ}
|";

	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ЗаказыПоставщикамОстаткиИОбороты.Склад", "Склад", "Склад", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента.Организация", "Организация", "Организация", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента", "ДоговорКонтрагента", "Договор контрагента", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ЗаказыПоставщикамОстаткиИОбороты.ДоговорКонтрагента.Владелец", "Контрагент", "Контрагент", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ЗаказыПоставщикамОстаткиИОбороты.ТорговаяТочка", "ТорговаяТочка", "ТорговаяТочка", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ТорговыеТочки);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ЗаказыПоставщикамОстаткиИОбороты.ЕдиницаИзмерения.Владелец", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Взаиморасчеты.Сделка", "Сделка", "Сделка", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документ_ЗаказПокупателя);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("Взаиморасчеты.ДокументРасчетовСКонтрагентом", "ДокументРасчетовСКонтрагентом", "Документ расчетов с контрагентом", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;

КонецПроцедуры

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Истина;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	УстановитьТекстЗапроса();
	
	ВалютаУпр = "(" + СокрЛП(глЗначениеПеременной("ВалютаУправленческогоУчета").Наименование) + ")";
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация", "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СостояниеСтрокиЗаказа", "Состояние строки заказа");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент", "Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента", "Договор контрагента");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Склад", "Склад");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтрокаЗаказа", "Строка заказа");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТорговаяТочка", "Торговая точка");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЕдиницаИзмерения", "Единица измерения");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоНачальныйОстаток", "Количество начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоКонечныйОстаток", "Количество конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоПриход", "Количество приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоРасход", "Количество расход");
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРеглНачальныйОстаток", "Сумма начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРеглКонечныйОстаток", "Сумма конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРеглПриход", "Сумма приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРеглРасход", "Сумма расход");
	
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаУпрНачальныйОстаток", "Сумма валютная начальный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаУпрКонечныйОстаток", "Сумма валютная конечный остаток");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаУпрПриход", "Сумма валютная приход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаУпрРасход", "Сумма валютная расход");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВалютаВзаиморасчетов", "Валюта взаиморасчетов");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоНачальныйОстаток", "нач. остаток", Истина, "ЧЦ=15; ЧДЦ=2", "КоличествоЗаказа", "Количество заказа");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоПриход", "приход", Истина, "ЧЦ=15; ЧДЦ=2", "КоличествоЗаказа", "Количество заказа");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоРасход", "расход", Истина, "ЧЦ=15; ЧДЦ=2", "КоличествоЗаказа", "Количество заказа");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоКонечныйОстаток",  "кон. остаток", Истина, "ЧЦ=15; ЧДЦ=2", "КоличествоЗаказа", "Количество заказа");
	
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРеглНачальныйОстаток", "нач. остаток", Истина, "ЧЦ=15; ЧДЦ=2", "СуммаЗаказа", "Сумма заказа");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРеглПриход", "приход", Истина, "ЧЦ=15; ЧДЦ=2", "СуммаЗаказа", "Сумма заказа");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРеглРасход", "расход", Истина, "ЧЦ=15; ЧДЦ=2", "СуммаЗаказа", "Сумма заказа");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРеглКонечныйОстаток",  "кон. остаток", Истина, "ЧЦ=15; ЧДЦ=2", "СуммаЗаказа", "Сумма заказа");
	
	
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрНачальныйОстаток", "нач. остаток", Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма валютная");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрПриход", "приход", Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма валютная");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрРасход", "расход", Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма валютная" );
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаУпрКонечныйОстаток", "кон. остаток", Истина, "ЧЦ=15; ЧДЦ=2", "СуммаУпр", "Сумма валютная");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Склад");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Контрагент");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	//УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СостояниеСтрокиЗаказа");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	 //|	ЗаявкиПокупателей.Склад Как Склад,
	 //|	ЗаявкиПокупателей.Качество Как Качество,
	 //|	ЗаявкиПокупателей.СтрокаЗаявки Как СтрокаЗаявки,
	 //|	ЗаявкиПокупателей.СостояниеСтрокиЗаявки Как СостояниеСтрокиЗаявки,
	 //|	ЗаявкиПокупателей.ТорговаяТочка как ТорговаяТочка,
	
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Организация");
	УниверсальныйОтчет.ДобавитьОтбор("Склад");
	УниверсальныйОтчет.ДобавитьОтбор("Контрагент");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	//УниверсальныйОтчет.УстановитьСвязьПолей("ВалютаВзаиморасчетов", "ДоговорКонтрагента");
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	//УниверсальныйОтчет.ДобавитьДополнительноеПоле("ВалютаВзаиморасчетов");
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формированием отчета можно установить необходимые параметры универсального отчета
	
	ЕстьПолеРегистратор = Ложь;
	Для каждого ВыбранноеПоле Из УниверсальныйОтчет.ПостроительОтчета.ВыбранныеПоля Цикл
	
		ЕстьПолеРегистратор = Найти(ВыбранноеПоле.ПутьКДанным, "Регистратор") > 0;
		Если ЕстьПолеРегистратор Тогда
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	НастройкиПостроителя = УниверсальныйОтчет.ПостроительОтчета.ПолучитьНастройки(); 
	УстановитьТекстЗапроса(ЕстьПолеРегистратор);
	УниверсальныйОтчет.ПостроительОтчета.УстановитьНастройки(НастройкиПостроителя); 
	
	Если ЕстьПолеРегистратор Тогда
		
		НетГруппировкиПоДоговору = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти("ДоговорКонтрагента") = Неопределено;
		Если НетГруппировкиПоДоговору Тогда
		
			НужноеИзмерение = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти("Контрагент");
			Если НужноеИзмерение = Неопределено Тогда
				НужноеИзмерение = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти("Организация");
			КонецЕсли;
			Если НужноеИзмерение = Неопределено Тогда
				НужноеИзмерение = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Найти("ВалютаВзаиморасчетов");
			КонецЕсли;
			
			Если НужноеИзмерение = Неопределено Тогда
				ИндексДоговора = 0;
			Иначе
				ИндексДоговора = УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Индекс(НужноеИзмерение) + 1;
			КонецЕсли;
				
			УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Вставить("ДоговорКонтрагента", , , , , ИндексДоговора);
		
		КонецЕсли;
	
	КонецЕсли;
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);

КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
